# RequestOrphanMullionDeletion Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..CurtainWallFailures..::..RequestOrphanMullionDeletion Property
BuiltInFailures..::..CurtainWallFailures Class See Also
---
Due to the changes in parameters of their hosts some mullions became non-type driven.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId RequestOrphanMullionDeletion { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property RequestOrphanMullionDeletion As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ RequestOrphanMullionDeletion {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..CurtainWallFailures Class
Autodesk.Revit.DB Namespace